Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2025DAR169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA9C4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA113" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA113" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2815" edc:desc="" edc:mask="0xf" edc:name="PIXEL2815" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2814" edc:desc="" edc:mask="0xf" edc:name="PIXEL2814" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2813" edc:desc="" edc:mask="0xf" edc:name="PIXEL2813" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2812" edc:desc="" edc:mask="0xf" edc:name="PIXEL2812" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2811" edc:desc="" edc:mask="0xf" edc:name="PIXEL2811" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2810" edc:desc="" edc:mask="0xf" edc:name="PIXEL2810" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL289" edc:desc="" edc:mask="0xf" edc:name="PIXEL289" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL288" edc:desc="" edc:mask="0xf" edc:name="PIXEL288" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9C8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA114" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA114" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2823" edc:desc="" edc:mask="0xf" edc:name="PIXEL2823" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2822" edc:desc="" edc:mask="0xf" edc:name="PIXEL2822" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2821" edc:desc="" edc:mask="0xf" edc:name="PIXEL2821" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2820" edc:desc="" edc:mask="0xf" edc:name="PIXEL2820" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2819" edc:desc="" edc:mask="0xf" edc:name="PIXEL2819" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2818" edc:desc="" edc:mask="0xf" edc:name="PIXEL2818" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2817" edc:desc="" edc:mask="0xf" edc:name="PIXEL2817" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2816" edc:desc="" edc:mask="0xf" edc:name="PIXEL2816" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9CC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA115" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA115" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2831" edc:desc="" edc:mask="0xf" edc:name="PIXEL2831" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2830" edc:desc="" edc:mask="0xf" edc:name="PIXEL2830" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2829" edc:desc="" edc:mask="0xf" edc:name="PIXEL2829" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2828" edc:desc="" edc:mask="0xf" edc:name="PIXEL2828" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2827" edc:desc="" edc:mask="0xf" edc:name="PIXEL2827" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2826" edc:desc="" edc:mask="0xf" edc:name="PIXEL2826" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2825" edc:desc="" edc:mask="0xf" edc:name="PIXEL2825" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2824" edc:desc="" edc:mask="0xf" edc:name="PIXEL2824" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9D0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA116" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA116" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL297" edc:desc="" edc:mask="0xf" edc:name="PIXEL297" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL296" edc:desc="" edc:mask="0xf" edc:name="PIXEL296" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL295" edc:desc="" edc:mask="0xf" edc:name="PIXEL295" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL294" edc:desc="" edc:mask="0xf" edc:name="PIXEL294" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL293" edc:desc="" edc:mask="0xf" edc:name="PIXEL293" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL292" edc:desc="" edc:mask="0xf" edc:name="PIXEL292" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL291" edc:desc="" edc:mask="0xf" edc:name="PIXEL291" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL290" edc:desc="" edc:mask="0xf" edc:name="PIXEL290" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9D4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA117" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA117" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2915" edc:desc="" edc:mask="0xf" edc:name="PIXEL2915" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2914" edc:desc="" edc:mask="0xf" edc:name="PIXEL2914" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2913" edc:desc="" edc:mask="0xf" edc:name="PIXEL2913" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2912" edc:desc="" edc:mask="0xf" edc:name="PIXEL2912" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2911" edc:desc="" edc:mask="0xf" edc:name="PIXEL2911" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2910" edc:desc="" edc:mask="0xf" edc:name="PIXEL2910" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL299" edc:desc="" edc:mask="0xf" edc:name="PIXEL299" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL298" edc:desc="" edc:mask="0xf" edc:name="PIXEL298" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9D8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA118" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA118" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2923" edc:desc="" edc:mask="0xf" edc:name="PIXEL2923" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2922" edc:desc="" edc:mask="0xf" edc:name="PIXEL2922" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2921" edc:desc="" edc:mask="0xf" edc:name="PIXEL2921" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2920" edc:desc="" edc:mask="0xf" edc:name="PIXEL2920" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2919" edc:desc="" edc:mask="0xf" edc:name="PIXEL2919" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2918" edc:desc="" edc:mask="0xf" edc:name="PIXEL2918" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2917" edc:desc="" edc:mask="0xf" edc:name="PIXEL2917" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2916" edc:desc="" edc:mask="0xf" edc:name="PIXEL2916" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9DC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA119" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA119" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2931" edc:desc="" edc:mask="0xf" edc:name="PIXEL2931" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2930" edc:desc="" edc:mask="0xf" edc:name="PIXEL2930" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2929" edc:desc="" edc:mask="0xf" edc:name="PIXEL2929" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2928" edc:desc="" edc:mask="0xf" edc:name="PIXEL2928" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2927" edc:desc="" edc:mask="0xf" edc:name="PIXEL2927" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2926" edc:desc="" edc:mask="0xf" edc:name="PIXEL2926" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2925" edc:desc="" edc:mask="0xf" edc:name="PIXEL2925" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2924" edc:desc="" edc:mask="0xf" edc:name="PIXEL2924" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
