Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2025DAR169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA9E0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA120" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA120" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL307" edc:desc="" edc:mask="0xf" edc:name="PIXEL307" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL306" edc:desc="" edc:mask="0xf" edc:name="PIXEL306" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL305" edc:desc="" edc:mask="0xf" edc:name="PIXEL305" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL304" edc:desc="" edc:mask="0xf" edc:name="PIXEL304" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL303" edc:desc="" edc:mask="0xf" edc:name="PIXEL303" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL302" edc:desc="" edc:mask="0xf" edc:name="PIXEL302" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL301" edc:desc="" edc:mask="0xf" edc:name="PIXEL301" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL300" edc:desc="" edc:mask="0xf" edc:name="PIXEL300" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9E4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA121" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA121" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL3015" edc:desc="" edc:mask="0xf" edc:name="PIXEL3015" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3014" edc:desc="" edc:mask="0xf" edc:name="PIXEL3014" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3013" edc:desc="" edc:mask="0xf" edc:name="PIXEL3013" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3012" edc:desc="" edc:mask="0xf" edc:name="PIXEL3012" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3011" edc:desc="" edc:mask="0xf" edc:name="PIXEL3011" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3010" edc:desc="" edc:mask="0xf" edc:name="PIXEL3010" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL309" edc:desc="" edc:mask="0xf" edc:name="PIXEL309" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL308" edc:desc="" edc:mask="0xf" edc:name="PIXEL308" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9E8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA122" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA122" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL3023" edc:desc="" edc:mask="0xf" edc:name="PIXEL3023" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3022" edc:desc="" edc:mask="0xf" edc:name="PIXEL3022" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3021" edc:desc="" edc:mask="0xf" edc:name="PIXEL3021" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3020" edc:desc="" edc:mask="0xf" edc:name="PIXEL3020" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3019" edc:desc="" edc:mask="0xf" edc:name="PIXEL3019" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3018" edc:desc="" edc:mask="0xf" edc:name="PIXEL3018" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3017" edc:desc="" edc:mask="0xf" edc:name="PIXEL3017" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3016" edc:desc="" edc:mask="0xf" edc:name="PIXEL3016" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9EC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA123" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA123" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL3031" edc:desc="" edc:mask="0xf" edc:name="PIXEL3031" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3030" edc:desc="" edc:mask="0xf" edc:name="PIXEL3030" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3029" edc:desc="" edc:mask="0xf" edc:name="PIXEL3029" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3028" edc:desc="" edc:mask="0xf" edc:name="PIXEL3028" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3027" edc:desc="" edc:mask="0xf" edc:name="PIXEL3027" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3026" edc:desc="" edc:mask="0xf" edc:name="PIXEL3026" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3025" edc:desc="" edc:mask="0xf" edc:name="PIXEL3025" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3024" edc:desc="" edc:mask="0xf" edc:name="PIXEL3024" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9F0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA124" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA124" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL317" edc:desc="" edc:mask="0xf" edc:name="PIXEL317" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL316" edc:desc="" edc:mask="0xf" edc:name="PIXEL316" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL315" edc:desc="" edc:mask="0xf" edc:name="PIXEL315" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL314" edc:desc="" edc:mask="0xf" edc:name="PIXEL314" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL313" edc:desc="" edc:mask="0xf" edc:name="PIXEL313" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL312" edc:desc="" edc:mask="0xf" edc:name="PIXEL312" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL311" edc:desc="" edc:mask="0xf" edc:name="PIXEL311" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL310" edc:desc="" edc:mask="0xf" edc:name="PIXEL310" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9F4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA125" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA125" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL3115" edc:desc="" edc:mask="0xf" edc:name="PIXEL3115" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3114" edc:desc="" edc:mask="0xf" edc:name="PIXEL3114" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3113" edc:desc="" edc:mask="0xf" edc:name="PIXEL3113" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3112" edc:desc="" edc:mask="0xf" edc:name="PIXEL3112" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3111" edc:desc="" edc:mask="0xf" edc:name="PIXEL3111" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3110" edc:desc="" edc:mask="0xf" edc:name="PIXEL3110" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL319" edc:desc="" edc:mask="0xf" edc:name="PIXEL319" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL318" edc:desc="" edc:mask="0xf" edc:name="PIXEL318" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9F8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA126" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA126" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL3123" edc:desc="" edc:mask="0xf" edc:name="PIXEL3123" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3122" edc:desc="" edc:mask="0xf" edc:name="PIXEL3122" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3121" edc:desc="" edc:mask="0xf" edc:name="PIXEL3121" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3120" edc:desc="" edc:mask="0xf" edc:name="PIXEL3120" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3119" edc:desc="" edc:mask="0xf" edc:name="PIXEL3119" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3118" edc:desc="" edc:mask="0xf" edc:name="PIXEL3118" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3117" edc:desc="" edc:mask="0xf" edc:name="PIXEL3117" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3116" edc:desc="" edc:mask="0xf" edc:name="PIXEL3116" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9FC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA127" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA127" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL3131" edc:desc="" edc:mask="0xf" edc:name="PIXEL3131" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3130" edc:desc="" edc:mask="0xf" edc:name="PIXEL3130" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3129" edc:desc="" edc:mask="0xf" edc:name="PIXEL3129" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3128" edc:desc="" edc:mask="0xf" edc:name="PIXEL3128" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3127" edc:desc="" edc:mask="0xf" edc:name="PIXEL3127" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3126" edc:desc="" edc:mask="0xf" edc:name="PIXEL3126" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3125" edc:desc="" edc:mask="0xf" edc:name="PIXEL3125" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL3124" edc:desc="" edc:mask="0xf" edc:name="PIXEL3124" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
