Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2025DAR169.PIC
      <edc:SFRDef edc:_addr="0x1F8EC028" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="-----nnn----nnnn-------nnn-nnnn-" edc:cname="SDHCCON1" edc:desc="" edc:impl="0x70f01df" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000----0000-------000-0000-" edc:name="SDHCCON1" edc:nzwidth="32" edc:por="-----000----0000-------000-0000-" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DTXWIDTH" edc:desc="" edc:mask="0x1" edc:name="DTXWIDTH" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HSEN" edc:desc="" edc:mask="0x1" edc:name="HSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMASEL" edc:desc="" edc:mask="0x3" edc:name="DMASEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CDTLVL" edc:desc="" edc:mask="0x1" edc:name="CDTLVL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CDSSEL" edc:desc="" edc:mask="0x1" edc:name="CDSSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDBP" edc:desc="" edc:mask="0x1" edc:name="SDBP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="SBGREQ" edc:desc="" edc:mask="0x1" edc:name="SBGREQ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CONTREQ" edc:desc="" edc:mask="0x1" edc:name="CONTREQ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RDWTCON" edc:desc="" edc:mask="0x1" edc:name="RDWTCON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INTBG" edc:desc="" edc:mask="0x1" edc:name="INTBG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="WKONINT" edc:desc="" edc:mask="0x1" edc:name="WKONINT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WKONINS" edc:desc="" edc:mask="0x1" edc:name="WKONINS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WKONREM" edc:desc="" edc:mask="0x1" edc:name="WKONREM" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC02C" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="-----nnn----nnnnnnnnnnnnnnn--nnn" edc:cname="SDHCCON2" edc:desc="" edc:impl="0x70fffe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000----000000000000000--000" edc:name="SDHCCON2" edc:nzwidth="32" edc:por="-----000----000000000000000--000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICLKEN" edc:desc="" edc:mask="0x1" edc:name="ICLKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICLKSTABLE" edc:desc="" edc:mask="0x1" edc:name="ICLKSTABLE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDCLKEN" edc:desc="" edc:mask="0x1" edc:name="SDCLKEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SDCLKDIV" edc:desc="" edc:mask="0xff" edc:name="SDCLKDIV" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="DTOC" edc:desc="" edc:mask="0xf" edc:name="DTOC" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="SWRALL" edc:desc="" edc:mask="0x1" edc:name="SWRALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWRCMD" edc:desc="" edc:mask="0x1" edc:name="SWRCMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWRDATA" edc:desc="" edc:mask="0x1" edc:name="SWRDAT" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC030" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="------rrrrrrrrrrr------rrrrrrrrr" edc:cname="SDHCINTSTAT" edc:desc="" edc:impl="0x3ff81ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------11111111111------111111111" edc:name="SDHCINTSTAT" edc:nzwidth="32" edc:por="------11111111111------111111111" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCIF" edc:desc="" edc:mask="0x1" edc:name="CCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="" edc:mask="0x1" edc:name="TXCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BGIF" edc:desc="" edc:mask="0x1" edc:name="BGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIF" edc:desc="" edc:mask="0x1" edc:name="DMAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BWRDYIF" edc:desc="" edc:mask="0x1" edc:name="BWRDYIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BRRDYIF" edc:desc="" edc:mask="0x1" edc:name="BRRDYIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDIIF" edc:desc="" edc:mask="0x1" edc:name="CARDIIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDRIF" edc:desc="" edc:mask="0x1" edc:name="CARDRIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDIF" edc:desc="" edc:mask="0x1" edc:name="CARDIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="EIF" edc:desc="" edc:mask="0x1" edc:name="EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTOEIF" edc:desc="" edc:mask="0x1" edc:name="CTOEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCRCEIF" edc:desc="" edc:mask="0x1" edc:name="CCRCEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CEBEIF" edc:desc="" edc:mask="0x1" edc:name="CEBEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CIDXEIF" edc:desc="" edc:mask="0x1" edc:name="CIDXEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DTOEIF" edc:desc="" edc:mask="0x1" edc:name="DTOEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DCRCEIF" edc:desc="" edc:mask="0x1" edc:name="DCRCEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DEBEIF" edc:desc="" edc:mask="0x1" edc:name="DEBEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLEIF" edc:desc="" edc:mask="0x1" edc:name="CLEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEIF" edc:desc="" edc:mask="0x1" edc:name="ACEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADEIF" edc:desc="" edc:mask="0x1" edc:name="ADEIF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC034" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="-------nnnnnnnnnn------nnnnnnnnn" edc:cname="SDHCINTEN" edc:desc="" edc:impl="0x3ff81ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00000000000------000000000" edc:name="SDHCINTEN" edc:nzwidth="32" edc:por="------00000000000------000000000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCIE" edc:desc="" edc:mask="0x1" edc:name="CCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXCIE" edc:desc="" edc:mask="0x1" edc:name="TXCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BGIE" edc:desc="" edc:mask="0x1" edc:name="BGIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BWRDYIE" edc:desc="" edc:mask="0x1" edc:name="BWRDYIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BRRDYIE" edc:desc="" edc:mask="0x1" edc:name="BRRDYIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDIIE" edc:desc="" edc:mask="0x1" edc:name="CARDIIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDRIE" edc:desc="" edc:mask="0x1" edc:name="CARDRIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDIE" edc:desc="" edc:mask="0x1" edc:name="CARDIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="EIE" edc:desc="" edc:mask="0x1" edc:name="EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTOEIE" edc:desc="" edc:mask="0x1" edc:name="CTOEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCRCEIE" edc:desc="" edc:mask="0x1" edc:name="CCRCEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CEBEIE" edc:desc="" edc:mask="0x1" edc:name="CEBEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CIDXEIE" edc:desc="" edc:mask="0x1" edc:name="CIDXEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DTOEIE" edc:desc="" edc:mask="0x1" edc:name="DTOEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DCRCEIE" edc:desc="" edc:mask="0x1" edc:name="DCRCEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DEBEIE" edc:desc="" edc:mask="0x1" edc:name="DEBEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLEIE" edc:desc="" edc:mask="0x1" edc:name="CLEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEIE" edc:desc="" edc:mask="0x1" edc:name="ACEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADEIE" edc:desc="" edc:mask="0x1" edc:name="ADEIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC038" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="------nnnnnnnnnnn------nnnnnnnnn" edc:cname="SDHCINTSEN" edc:desc="" edc:impl="0x3ff81ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00000000000------000000000" edc:name="SDHCINTSEN" edc:nzwidth="32" edc:por="------00000000000------000000000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCISE" edc:desc="" edc:mask="0x1" edc:name="CCISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXCISE" edc:desc="" edc:mask="0x1" edc:name="TXCISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BGISE" edc:desc="" edc:mask="0x1" edc:name="BGISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAISE" edc:desc="" edc:mask="0x1" edc:name="DMAISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BWRDYISE" edc:desc="" edc:mask="0x1" edc:name="BWRDYISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BRRDYISE" edc:desc="" edc:mask="0x1" edc:name="BRRDYISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDIISE" edc:desc="" edc:mask="0x1" edc:name="CARDIISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDRISE" edc:desc="" edc:mask="0x1" edc:name="CARDRISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CARDISE" edc:desc="" edc:mask="0x1" edc:name="CARDISE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="EISE" edc:desc="" edc:mask="0x1" edc:name="EISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTOEISE" edc:desc="" edc:mask="0x1" edc:name="CTOEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCRCEISE" edc:desc="" edc:mask="0x1" edc:name="CCRCEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CEBEISE" edc:desc="" edc:mask="0x1" edc:name="CEBEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CIDXEISE" edc:desc="" edc:mask="0x1" edc:name="CIDXEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DTOEISE" edc:desc="" edc:mask="0x1" edc:name="DTOEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DCRCEISE" edc:desc="" edc:mask="0x1" edc:name="DCRCEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DEBEISE" edc:desc="" edc:mask="0x1" edc:name="DEBEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLEISE" edc:desc="" edc:mask="0x1" edc:name="CLEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEISE" edc:desc="" edc:mask="0x1" edc:name="ACEISE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADEISE" edc:desc="" edc:mask="0x1" edc:name="ADEISE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC03C" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="------------------------r--rrrrr" edc:cname="SDHCSTAT2" edc:desc="" edc:impl="0x9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------0--00000" edc:name="SDHCSTAT2" edc:nzwidth="32" edc:por="------------------------0--00000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ACNEXEC" edc:desc="" edc:mask="0x1" edc:name="ACNEXEC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACTOE" edc:desc="" edc:mask="0x1" edc:name="ACTOE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACCRCE" edc:desc="" edc:mask="0x1" edc:name="ACCRCE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEBE" edc:desc="" edc:mask="0x1" edc:name="ACEBE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACIDXE" edc:desc="" edc:mask="0x1" edc:name="ACIDXE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CNISSE" edc:desc="" edc:mask="0x1" edc:name="CNISSE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
